In [72]:
import pandas as pd
import numpy as np

In [73]:
d = pd.DataFrame()
d['A'] = [2, 3, 4, np.nan]
d['B'] = [1, 2, np.nan, 4]
d.index = [1, 2, 3, 4]
d

     A    B
1  2.0  1.0
2  3.0  2.0
3  4.0  NaN
4  NaN  4.0

In [76]:
d2 = pd.DataFrame()
d2['A'] = [1, 3, 4]
d2['C'] = [2,0,3]
d2.index = [1, 2, 4]
d2

   A  C
1  1  2
2  3  0
4  4  3

In [68]:
(d['A'] + d2['B']).fillna(d['A'])

1    4.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [83]:
d2[['A', 'C']].rename(columns = {'C': 'B'})

   A  B
1  1  2
2  3  0
4  4  3

In [84]:
d[['A','B']] + d2[['A', 'C']].rename(columns = {'C': 'B'})

     A    B
1  3.0  3.0
2  6.0  2.0
3  NaN  NaN
4  NaN  7.0

In [71]:
(d[['A','B']] + d2[['B', 'A']]).fillna(d[['A', 'B']])

     A    B
1  3.0  3.0
2  6.0  2.0
3  4.0  NaN
4  NaN  7.0

In [31]:
d.A + d2.A.fillna(0)

a    4.0
b    3.0
c    NaN
d    NaN
Name: A, dtype: float64